name: "caption_lstm_baseline_resnet"
layer {
  name: "sequence_data"
  type: "Python"
  top: "image_id"
  top: "input_sentence"
  top: "target_sentence"
  top: "num_boxes"
  top: "boxes"
  top: "features"
  python_param {
    module: "efficient_rcnn_layers"
    layer: "RCNNCaptionTrainDataLayer"
    param_str: "{\'end_of_sequence\': 0, \'caption_sources\': [\'data/coco_splits/train_captions.txt\'], \'sequence_length\': 20, \'pool\': True, \'ignore_label\': 1, \'feature_sources\': [\'data/tsv/trainval/karpathy_train_resnet101_baseline.tsv.0\', \'data/tsv/trainval/karpathy_train_resnet101_baseline.tsv.1\'], \'max_boxes\': 100, \'batch_size\': 50}"
  }
}
layer {
  name: "feature_slice_layer"
  type: "Slice"
  bottom: "features"
  top: "avg_pool"
  top: "spatial_features"
  slice_param {
    slice_dim: 1
    slice_point: 1
  }
}
layer {
  name: "context"
  type: "Flatten"
  bottom: "avg_pool"
  top: "context"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "fc"
  type: "InnerProduct"
  bottom: "spatial_features"
  top: "fc"
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "input_slice"
  type: "Slice"
  bottom: "input_sentence"
  top: "input"
  top: "input_1"
  top: "input_2"
  top: "input_3"
  top: "input_4"
  top: "input_5"
  top: "input_6"
  top: "input_7"
  top: "input_8"
  top: "input_9"
  top: "input_10"
  top: "input_11"
  top: "input_12"
  top: "input_13"
  top: "input_14"
  top: "input_15"
  top: "input_16"
  top: "input_17"
  top: "input_18"
  top: "input_19"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
  }
}
layer {
  name: "lstm0_hidden_prev"
  type: "DummyData"
  top: "lstm0_hidden_prev"
  dummy_data_param {
    shape {
      dim: 50
      dim: 1000
    }
  }
}
layer {
  name: "lstm0_mem_cell_prev"
  type: "DummyData"
  top: "lstm0_mem_cell_prev"
  dummy_data_param {
    shape {
      dim: 50
      dim: 1000
    }
  }
}
layer {
  name: "lstm1_hidden_prev"
  type: "DummyData"
  top: "lstm1_hidden_prev"
  dummy_data_param {
    shape {
      dim: 50
      dim: 1000
    }
  }
}
layer {
  name: "lstm1_mem_cell_prev"
  type: "DummyData"
  top: "lstm1_mem_cell_prev"
  dummy_data_param {
    shape {
      dim: 50
      dim: 1000
    }
  }
}
layer {
  name: "embedding"
  type: "Embed"
  bottom: "input"
  top: "embedding"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t0"
  type: "Concat"
  bottom: "embedding"
  bottom: "context"
  bottom: "lstm1_hidden_prev"
  bottom: "lstm0_hidden_prev"
  top: "concat0_t0"
}
layer {
  name: "lstm1"
  type: "LSTMNode"
  bottom: "concat0_t0"
  bottom: "lstm0_mem_cell_prev"
  top: "lstm0_hidden0"
  top: "lstm0_mem_cell0"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: false
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_0"
  type: "InnerProduct"
  bottom: "lstm0_hidden0"
  top: "hidden_att_0"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_0"
  type: "Tile"
  bottom: "hidden_att_0"
  top: "tile_hidden_att_0"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_0"
  type: "Reshape"
  bottom: "tile_hidden_att_0"
  top: "tile_hidden_reshape_0"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_0"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_0"
  top: "sum_hidden_att_0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_0"
  type: "TanH"
  bottom: "sum_hidden_att_0"
  top: "sum_hidden_att_0"
}
layer {
  name: "predict_att_0"
  type: "InnerProduct"
  bottom: "sum_hidden_att_0"
  top: "predict_att_0"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_0"
  type: "Reshape"
  bottom: "predict_att_0"
  top: "reshape_predict_att_0"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_0"
  type: "Softmax"
  bottom: "reshape_predict_att_0"
  bottom: "num_boxes"
  top: "att_weight_0"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_0"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_0"
  top: "att_product_0"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_0"
  type: "Permute"
  bottom: "att_product_0"
  top: "permute_att_0"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_0"
  type: "Reduction"
  bottom: "permute_att_0"
  top: "fc8_0"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t0"
  type: "Concat"
  bottom: "lstm0_hidden0"
  bottom: "fc8_0"
  bottom: "lstm1_hidden_prev"
  top: "concat1_t0"
}
layer {
  name: "lstm2"
  type: "LSTMNode"
  bottom: "concat1_t0"
  bottom: "lstm1_mem_cell_prev"
  top: "lstm1_hidden0"
  top: "lstm1_mem_cell0"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: false
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict"
  type: "InnerProduct"
  bottom: "lstm1_hidden0"
  top: "predict"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_1"
  type: "Embed"
  bottom: "input_1"
  top: "embedding_1"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t1"
  type: "Concat"
  bottom: "embedding_1"
  bottom: "context"
  bottom: "lstm1_hidden0"
  bottom: "lstm0_hidden0"
  top: "concat0_t1"
}
layer {
  name: "lstm1_t1"
  type: "LSTMNode"
  bottom: "concat0_t1"
  bottom: "lstm0_mem_cell0"
  top: "lstm0_hidden1"
  top: "lstm0_mem_cell1"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_1"
  type: "InnerProduct"
  bottom: "lstm0_hidden1"
  top: "hidden_att_1"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_1"
  type: "Tile"
  bottom: "hidden_att_1"
  top: "tile_hidden_att_1"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_1"
  type: "Reshape"
  bottom: "tile_hidden_att_1"
  top: "tile_hidden_reshape_1"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_1"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_1"
  top: "sum_hidden_att_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_1"
  type: "TanH"
  bottom: "sum_hidden_att_1"
  top: "sum_hidden_att_1"
}
layer {
  name: "predict_att_1"
  type: "InnerProduct"
  bottom: "sum_hidden_att_1"
  top: "predict_att_1"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_1"
  type: "Reshape"
  bottom: "predict_att_1"
  top: "reshape_predict_att_1"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_1"
  type: "Softmax"
  bottom: "reshape_predict_att_1"
  bottom: "num_boxes"
  top: "att_weight_1"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_1"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_1"
  top: "att_product_1"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_1"
  type: "Permute"
  bottom: "att_product_1"
  top: "permute_att_1"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_1"
  type: "Reduction"
  bottom: "permute_att_1"
  top: "fc8_1"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t1"
  type: "Concat"
  bottom: "lstm0_hidden1"
  bottom: "fc8_1"
  bottom: "lstm1_hidden0"
  top: "concat1_t1"
}
layer {
  name: "lstm2_t1"
  type: "LSTMNode"
  bottom: "concat1_t1"
  bottom: "lstm1_mem_cell0"
  top: "lstm1_hidden1"
  top: "lstm1_mem_cell1"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_1"
  type: "InnerProduct"
  bottom: "lstm1_hidden1"
  top: "predict_1"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_2"
  type: "Embed"
  bottom: "input_2"
  top: "embedding_2"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t2"
  type: "Concat"
  bottom: "embedding_2"
  bottom: "context"
  bottom: "lstm1_hidden1"
  bottom: "lstm0_hidden1"
  top: "concat0_t2"
}
layer {
  name: "lstm1_t2"
  type: "LSTMNode"
  bottom: "concat0_t2"
  bottom: "lstm0_mem_cell1"
  top: "lstm0_hidden2"
  top: "lstm0_mem_cell2"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_2"
  type: "InnerProduct"
  bottom: "lstm0_hidden2"
  top: "hidden_att_2"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_2"
  type: "Tile"
  bottom: "hidden_att_2"
  top: "tile_hidden_att_2"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_2"
  type: "Reshape"
  bottom: "tile_hidden_att_2"
  top: "tile_hidden_reshape_2"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_2"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_2"
  top: "sum_hidden_att_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_2"
  type: "TanH"
  bottom: "sum_hidden_att_2"
  top: "sum_hidden_att_2"
}
layer {
  name: "predict_att_2"
  type: "InnerProduct"
  bottom: "sum_hidden_att_2"
  top: "predict_att_2"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_2"
  type: "Reshape"
  bottom: "predict_att_2"
  top: "reshape_predict_att_2"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_2"
  type: "Softmax"
  bottom: "reshape_predict_att_2"
  bottom: "num_boxes"
  top: "att_weight_2"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_2"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_2"
  top: "att_product_2"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_2"
  type: "Permute"
  bottom: "att_product_2"
  top: "permute_att_2"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_2"
  type: "Reduction"
  bottom: "permute_att_2"
  top: "fc8_2"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t2"
  type: "Concat"
  bottom: "lstm0_hidden2"
  bottom: "fc8_2"
  bottom: "lstm1_hidden1"
  top: "concat1_t2"
}
layer {
  name: "lstm2_t2"
  type: "LSTMNode"
  bottom: "concat1_t2"
  bottom: "lstm1_mem_cell1"
  top: "lstm1_hidden2"
  top: "lstm1_mem_cell2"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_2"
  type: "InnerProduct"
  bottom: "lstm1_hidden2"
  top: "predict_2"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_3"
  type: "Embed"
  bottom: "input_3"
  top: "embedding_3"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t3"
  type: "Concat"
  bottom: "embedding_3"
  bottom: "context"
  bottom: "lstm1_hidden2"
  bottom: "lstm0_hidden2"
  top: "concat0_t3"
}
layer {
  name: "lstm1_t3"
  type: "LSTMNode"
  bottom: "concat0_t3"
  bottom: "lstm0_mem_cell2"
  top: "lstm0_hidden3"
  top: "lstm0_mem_cell3"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_3"
  type: "InnerProduct"
  bottom: "lstm0_hidden3"
  top: "hidden_att_3"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_3"
  type: "Tile"
  bottom: "hidden_att_3"
  top: "tile_hidden_att_3"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_3"
  type: "Reshape"
  bottom: "tile_hidden_att_3"
  top: "tile_hidden_reshape_3"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_3"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_3"
  top: "sum_hidden_att_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_3"
  type: "TanH"
  bottom: "sum_hidden_att_3"
  top: "sum_hidden_att_3"
}
layer {
  name: "predict_att_3"
  type: "InnerProduct"
  bottom: "sum_hidden_att_3"
  top: "predict_att_3"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_3"
  type: "Reshape"
  bottom: "predict_att_3"
  top: "reshape_predict_att_3"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_3"
  type: "Softmax"
  bottom: "reshape_predict_att_3"
  bottom: "num_boxes"
  top: "att_weight_3"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_3"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_3"
  top: "att_product_3"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_3"
  type: "Permute"
  bottom: "att_product_3"
  top: "permute_att_3"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_3"
  type: "Reduction"
  bottom: "permute_att_3"
  top: "fc8_3"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t3"
  type: "Concat"
  bottom: "lstm0_hidden3"
  bottom: "fc8_3"
  bottom: "lstm1_hidden2"
  top: "concat1_t3"
}
layer {
  name: "lstm2_t3"
  type: "LSTMNode"
  bottom: "concat1_t3"
  bottom: "lstm1_mem_cell2"
  top: "lstm1_hidden3"
  top: "lstm1_mem_cell3"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_3"
  type: "InnerProduct"
  bottom: "lstm1_hidden3"
  top: "predict_3"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_4"
  type: "Embed"
  bottom: "input_4"
  top: "embedding_4"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t4"
  type: "Concat"
  bottom: "embedding_4"
  bottom: "context"
  bottom: "lstm1_hidden3"
  bottom: "lstm0_hidden3"
  top: "concat0_t4"
}
layer {
  name: "lstm1_t4"
  type: "LSTMNode"
  bottom: "concat0_t4"
  bottom: "lstm0_mem_cell3"
  top: "lstm0_hidden4"
  top: "lstm0_mem_cell4"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_4"
  type: "InnerProduct"
  bottom: "lstm0_hidden4"
  top: "hidden_att_4"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_4"
  type: "Tile"
  bottom: "hidden_att_4"
  top: "tile_hidden_att_4"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_4"
  type: "Reshape"
  bottom: "tile_hidden_att_4"
  top: "tile_hidden_reshape_4"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_4"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_4"
  top: "sum_hidden_att_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_4"
  type: "TanH"
  bottom: "sum_hidden_att_4"
  top: "sum_hidden_att_4"
}
layer {
  name: "predict_att_4"
  type: "InnerProduct"
  bottom: "sum_hidden_att_4"
  top: "predict_att_4"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_4"
  type: "Reshape"
  bottom: "predict_att_4"
  top: "reshape_predict_att_4"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_4"
  type: "Softmax"
  bottom: "reshape_predict_att_4"
  bottom: "num_boxes"
  top: "att_weight_4"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_4"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_4"
  top: "att_product_4"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_4"
  type: "Permute"
  bottom: "att_product_4"
  top: "permute_att_4"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_4"
  type: "Reduction"
  bottom: "permute_att_4"
  top: "fc8_4"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t4"
  type: "Concat"
  bottom: "lstm0_hidden4"
  bottom: "fc8_4"
  bottom: "lstm1_hidden3"
  top: "concat1_t4"
}
layer {
  name: "lstm2_t4"
  type: "LSTMNode"
  bottom: "concat1_t4"
  bottom: "lstm1_mem_cell3"
  top: "lstm1_hidden4"
  top: "lstm1_mem_cell4"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_4"
  type: "InnerProduct"
  bottom: "lstm1_hidden4"
  top: "predict_4"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_5"
  type: "Embed"
  bottom: "input_5"
  top: "embedding_5"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t5"
  type: "Concat"
  bottom: "embedding_5"
  bottom: "context"
  bottom: "lstm1_hidden4"
  bottom: "lstm0_hidden4"
  top: "concat0_t5"
}
layer {
  name: "lstm1_t5"
  type: "LSTMNode"
  bottom: "concat0_t5"
  bottom: "lstm0_mem_cell4"
  top: "lstm0_hidden5"
  top: "lstm0_mem_cell5"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_5"
  type: "InnerProduct"
  bottom: "lstm0_hidden5"
  top: "hidden_att_5"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_5"
  type: "Tile"
  bottom: "hidden_att_5"
  top: "tile_hidden_att_5"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_5"
  type: "Reshape"
  bottom: "tile_hidden_att_5"
  top: "tile_hidden_reshape_5"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_5"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_5"
  top: "sum_hidden_att_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_5"
  type: "TanH"
  bottom: "sum_hidden_att_5"
  top: "sum_hidden_att_5"
}
layer {
  name: "predict_att_5"
  type: "InnerProduct"
  bottom: "sum_hidden_att_5"
  top: "predict_att_5"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_5"
  type: "Reshape"
  bottom: "predict_att_5"
  top: "reshape_predict_att_5"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_5"
  type: "Softmax"
  bottom: "reshape_predict_att_5"
  bottom: "num_boxes"
  top: "att_weight_5"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_5"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_5"
  top: "att_product_5"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_5"
  type: "Permute"
  bottom: "att_product_5"
  top: "permute_att_5"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_5"
  type: "Reduction"
  bottom: "permute_att_5"
  top: "fc8_5"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t5"
  type: "Concat"
  bottom: "lstm0_hidden5"
  bottom: "fc8_5"
  bottom: "lstm1_hidden4"
  top: "concat1_t5"
}
layer {
  name: "lstm2_t5"
  type: "LSTMNode"
  bottom: "concat1_t5"
  bottom: "lstm1_mem_cell4"
  top: "lstm1_hidden5"
  top: "lstm1_mem_cell5"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_5"
  type: "InnerProduct"
  bottom: "lstm1_hidden5"
  top: "predict_5"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_6"
  type: "Embed"
  bottom: "input_6"
  top: "embedding_6"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t6"
  type: "Concat"
  bottom: "embedding_6"
  bottom: "context"
  bottom: "lstm1_hidden5"
  bottom: "lstm0_hidden5"
  top: "concat0_t6"
}
layer {
  name: "lstm1_t6"
  type: "LSTMNode"
  bottom: "concat0_t6"
  bottom: "lstm0_mem_cell5"
  top: "lstm0_hidden6"
  top: "lstm0_mem_cell6"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_6"
  type: "InnerProduct"
  bottom: "lstm0_hidden6"
  top: "hidden_att_6"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_6"
  type: "Tile"
  bottom: "hidden_att_6"
  top: "tile_hidden_att_6"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_6"
  type: "Reshape"
  bottom: "tile_hidden_att_6"
  top: "tile_hidden_reshape_6"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_6"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_6"
  top: "sum_hidden_att_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_6"
  type: "TanH"
  bottom: "sum_hidden_att_6"
  top: "sum_hidden_att_6"
}
layer {
  name: "predict_att_6"
  type: "InnerProduct"
  bottom: "sum_hidden_att_6"
  top: "predict_att_6"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_6"
  type: "Reshape"
  bottom: "predict_att_6"
  top: "reshape_predict_att_6"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_6"
  type: "Softmax"
  bottom: "reshape_predict_att_6"
  bottom: "num_boxes"
  top: "att_weight_6"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_6"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_6"
  top: "att_product_6"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_6"
  type: "Permute"
  bottom: "att_product_6"
  top: "permute_att_6"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_6"
  type: "Reduction"
  bottom: "permute_att_6"
  top: "fc8_6"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t6"
  type: "Concat"
  bottom: "lstm0_hidden6"
  bottom: "fc8_6"
  bottom: "lstm1_hidden5"
  top: "concat1_t6"
}
layer {
  name: "lstm2_t6"
  type: "LSTMNode"
  bottom: "concat1_t6"
  bottom: "lstm1_mem_cell5"
  top: "lstm1_hidden6"
  top: "lstm1_mem_cell6"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_6"
  type: "InnerProduct"
  bottom: "lstm1_hidden6"
  top: "predict_6"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_7"
  type: "Embed"
  bottom: "input_7"
  top: "embedding_7"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t7"
  type: "Concat"
  bottom: "embedding_7"
  bottom: "context"
  bottom: "lstm1_hidden6"
  bottom: "lstm0_hidden6"
  top: "concat0_t7"
}
layer {
  name: "lstm1_t7"
  type: "LSTMNode"
  bottom: "concat0_t7"
  bottom: "lstm0_mem_cell6"
  top: "lstm0_hidden7"
  top: "lstm0_mem_cell7"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_7"
  type: "InnerProduct"
  bottom: "lstm0_hidden7"
  top: "hidden_att_7"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_7"
  type: "Tile"
  bottom: "hidden_att_7"
  top: "tile_hidden_att_7"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_7"
  type: "Reshape"
  bottom: "tile_hidden_att_7"
  top: "tile_hidden_reshape_7"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_7"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_7"
  top: "sum_hidden_att_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_7"
  type: "TanH"
  bottom: "sum_hidden_att_7"
  top: "sum_hidden_att_7"
}
layer {
  name: "predict_att_7"
  type: "InnerProduct"
  bottom: "sum_hidden_att_7"
  top: "predict_att_7"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_7"
  type: "Reshape"
  bottom: "predict_att_7"
  top: "reshape_predict_att_7"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_7"
  type: "Softmax"
  bottom: "reshape_predict_att_7"
  bottom: "num_boxes"
  top: "att_weight_7"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_7"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_7"
  top: "att_product_7"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_7"
  type: "Permute"
  bottom: "att_product_7"
  top: "permute_att_7"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_7"
  type: "Reduction"
  bottom: "permute_att_7"
  top: "fc8_7"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t7"
  type: "Concat"
  bottom: "lstm0_hidden7"
  bottom: "fc8_7"
  bottom: "lstm1_hidden6"
  top: "concat1_t7"
}
layer {
  name: "lstm2_t7"
  type: "LSTMNode"
  bottom: "concat1_t7"
  bottom: "lstm1_mem_cell6"
  top: "lstm1_hidden7"
  top: "lstm1_mem_cell7"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_7"
  type: "InnerProduct"
  bottom: "lstm1_hidden7"
  top: "predict_7"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_8"
  type: "Embed"
  bottom: "input_8"
  top: "embedding_8"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t8"
  type: "Concat"
  bottom: "embedding_8"
  bottom: "context"
  bottom: "lstm1_hidden7"
  bottom: "lstm0_hidden7"
  top: "concat0_t8"
}
layer {
  name: "lstm1_t8"
  type: "LSTMNode"
  bottom: "concat0_t8"
  bottom: "lstm0_mem_cell7"
  top: "lstm0_hidden8"
  top: "lstm0_mem_cell8"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_8"
  type: "InnerProduct"
  bottom: "lstm0_hidden8"
  top: "hidden_att_8"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_8"
  type: "Tile"
  bottom: "hidden_att_8"
  top: "tile_hidden_att_8"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_8"
  type: "Reshape"
  bottom: "tile_hidden_att_8"
  top: "tile_hidden_reshape_8"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 512
    }
  }
}
layer {
  name: "sum_hidden_att_8"
  type: "Eltwise"
  bottom: "fc"
  bottom: "tile_hidden_reshape_8"
  top: "sum_hidden_att_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hidden_tanh_8"
  type: "TanH"
  bottom: "sum_hidden_att_8"
  top: "sum_hidden_att_8"
}
layer {
  name: "predict_att_8"
  type: "InnerProduct"
  bottom: "sum_hidden_att_8"
  top: "predict_att_8"
  param {
    name: "predict_att_param_0"
  }
  inner_product_param {
    num_output: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    axis: 2
  }
}
layer {
  name: "reshape_predict_att_8"
  type: "Reshape"
  bottom: "predict_att_8"
  top: "reshape_predict_att_8"
  reshape_param {
    shape {
      dim: 0
      dim: -1
    }
  }
}
layer {
  name: "att_weight_8"
  type: "Softmax"
  bottom: "reshape_predict_att_8"
  bottom: "num_boxes"
  top: "att_weight_8"
  softmax_param {
    engine: CAFFE
    axis: 1
  }
}
layer {
  name: "att_product_8"
  type: "Scale"
  bottom: "spatial_features"
  bottom: "att_weight_8"
  top: "att_product_8"
  scale_param {
    axis: 0
  }
}
layer {
  name: "permute_att_8"
  type: "Permute"
  bottom: "att_product_8"
  top: "permute_att_8"
  permute_param {
    order: 0
    order: 2
    order: 1
  }
}
layer {
  name: "fc8_8"
  type: "Reduction"
  bottom: "permute_att_8"
  top: "fc8_8"
  reduction_param {
    axis: 2
  }
}
layer {
  name: "concat1_t8"
  type: "Concat"
  bottom: "lstm0_hidden8"
  bottom: "fc8_8"
  bottom: "lstm1_hidden7"
  top: "concat1_t8"
}
layer {
  name: "lstm2_t8"
  type: "LSTMNode"
  bottom: "concat1_t8"
  bottom: "lstm1_mem_cell7"
  top: "lstm1_hidden8"
  top: "lstm1_mem_cell8"
  param {
    name: "lstm1_param_0"
  }
  param {
    name: "lstm1_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "predict_8"
  type: "InnerProduct"
  bottom: "lstm1_hidden8"
  top: "predict_8"
  param {
    name: "predict_param_0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    name: "predict_param_1"
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 10010
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    axis: 1
  }
}
layer {
  name: "embedding_9"
  type: "Embed"
  bottom: "input_9"
  top: "embedding_9"
  param {
    name: "embed_param"
  }
  propagate_down: false
  embed_param {
    num_output: 1000
    input_dim: 10010
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "concat0_t9"
  type: "Concat"
  bottom: "embedding_9"
  bottom: "context"
  bottom: "lstm1_hidden8"
  bottom: "lstm0_hidden8"
  top: "concat0_t9"
}
layer {
  name: "lstm1_t9"
  type: "LSTMNode"
  bottom: "concat0_t9"
  bottom: "lstm0_mem_cell8"
  top: "lstm0_hidden9"
  top: "lstm0_mem_cell9"
  param {
    name: "lstm0_param_0"
  }
  param {
    name: "lstm0_param_1"
  }
  propagate_down: true
  propagate_down: true
  lstm_param {
    num_cells: 1000
    input_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    forget_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    output_gate_weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
    input_bias_filler {
      type: "constant"
      value: 0.0
    }
    input_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
    forget_gate_bias_filler {
      type: "constant"
      value: 1.0
    }
    output_gate_bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "hidden_att_9"
  type: "InnerProduct"
  bottom: "lstm0_hidden9"
  top: "hidden_att_9"
  param {
    name: "hidden_att_param_0"
  }
  inner_product_param {
    num_output: 512
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "tile_hidden_att_9"
  type: "Tile"
  bottom: "hidden_att_9"
  top: "tile_hidden_att_9"
  tile_param {
    axis: 1
    tiles: 100
  }
}
layer {
  name: "tile_hidden_reshape_9"
  type: "Reshape"
  bottom: "tile_hidden_att_9"
  top: "tile_hidden_reshape_9"
  reshape_param {
    shape {
